#+title: Deploy
* trigger release of images
- tag
* Container Images
** Builds
*** auditlogger
- log :: [[https://prow.k8s.io/view/gs/kubernetes-jenkins/logs/apisnoop-push-auditlogger-images][https://prow.k8s.io/view/gs/kubernetes-jenkins/logs/apisnoop-push-auditlogger-images/]]
** Image Tags / Pushes
The tag names are pretty long, and include commits. Need to find docs for how this is configured.

The PULL_BASE_REF from the prow post-submit jobs may be what creates the tags, though I'm not sure.

Would be nice to understand where v20230814-X-1.2.2-X-HASH is generated.
** Container Registry Images
Here is a list of images pushed to gcr.io.
I'm not sure where there are built and pushed yet.
Would be good to document it.

We can probably dorp kubemacs and hasura if we are no longer using them. Also postgres is probably unused.

Might want to refactor webapp as well and rename / give clear guidance as we decide what it is for.
#+begin_src shell
gcloud container images list --repository=gcr.io/k8s-staging-apisnoop
#+end_src

#+RESULTS:
#+begin_example
NAME
gcr.io/k8s-staging-apisnoop/auditlogger
gcr.io/k8s-staging-apisnoop/hasura
gcr.io/k8s-staging-apisnoop/kubemacs
gcr.io/k8s-staging-apisnoop/postgres
gcr.io/k8s-staging-apisnoop/snoopdb
gcr.io/k8s-staging-apisnoop/webapp
#+end_example
** Container Registry Image Tags
It may be that snoopdb and auditlogger tags are pushed to both images.

Though I'm unsure. My expectation would be that listing snoopdb would only show snoopdb tags etc.

Possibly I'm using the cli wrong.
*** snoopdb
#+begin_src shell
gcloud container images list-tags gcr.io/k8s-staging-apisnoop/snoopdb | head -10
#+end_src

#+RESULTS:
#+begin_example
DIGEST        TAGS                                    TIMESTAMP
019a4a1a5d0e  v20230814-snoopdb-1.2.2-3-g2f5dcd7      2023-08-14T08:33:22
9a3fda583abb  v20230814-snoopdb-1.2.1-3-g50e2093      2023-08-14T06:44:11
2b388e96c855  v20230814-snoopdb-1.2.1-2-g2cccab9      2023-08-14T06:37:39
69cd6dc1c02e  v20230814-auditlogger-1.2.0-3-gdd4d12f  2023-08-14T06:18:16
e5dd7227bba1  v20230814-auditlogger-1.2.0-2-g4467c62  2023-08-14T06:15:35
04c068cf7245  v20230814-auditlogger-1.2.0-1-g87e0645  2023-08-14T06:11:27
f24e3937a77b  v20230814-auditlogger-0.1.0-2-gc21bbf3  2023-08-14T05:39:10
bb8a2d3f6009  v20230813-0.2.0-606-g9205504            2023-08-14T00:58:06
884cdd0426aa  v20230813-0.2.0-605-gad37aae            2023-08-14T00:56:31
#+end_example
*** auditlogger
#+begin_src shell
gcloud container images list-tags gcr.io/k8s-staging-apisnoop/auditlogger | head -10
#+end_src

#+RESULTS:
#+begin_example
DIGEST        TAGS                                    TIMESTAMP
61964722158c  v20230814-snoopdb-1.2.2-3-g2f5dcd7      2023-08-14T08:31:35
e57cabcb51bf  v20230814-snoopdb-1.2.1-3-g50e2093      2023-08-14T06:42:26
67eac7a9010d  v20230814-snoopdb-1.2.1-2-g2cccab9      2023-08-14T06:35:58
63df745cd78a  v20230814-auditlogger-1.2.0-3-gdd4d12f  2023-08-14T06:16:24
c1ecac48b6ab  v20230814-auditlogger-1.2.0-2-g4467c62  2023-08-14T06:13:49
2dbce08a6466  v20230814-auditlogger-1.2.0-1-g87e0645  2023-08-14T06:09:55
e50c4ebc76f3  v20230814-auditlogger-0.1.0-2-gc21bbf3  2023-08-14T05:37:23
56f3843da01d  v20230813-0.2.0-606-g9205504            2023-08-14T00:56:20
d75da6f612fc  v20230813-0.2.0-605-gad37aae            2023-08-14T00:54:39
#+end_example
* Helm Repo
** Build Chart Release Tarball
I think that's done via https://github.com/cncf/apisnoop/blob/main/.github/workflows/helm-chart-releaser.yml
on pushes to main.
** Chart Release Artifacts
I'm see these here, but I'm not sure who creates the tag and how. I suspect it's automated.
https://github.com/cncf/apisnoop/releases
** Chart index.yaml
This get's updated to point to the release artifacts
https://cncf.github.io/apisnoop/index.yaml
* Access via helm cli
** Add apisnoop helm repo
#+begin_src shell
helm repo add apisnoop https://cncf.github.io/apisnoop/
#+end_src
** list charts
#+begin_src shell
helm search repo apisnoop -l
#+end_src

#+RESULTS:
#+begin_example
NAME                	CHART VERSION	APP VERSION                           	DESCRIPTION
apisnoop/auditlogger	1.2.0        	2022.08.14-01                         	A processor for Kubernetes Audit logs, which in...
apisnoop/auditlogger	0.1.0        	v20210829-0.2.0-73-g62230c7           	A processor for Kubernetes Audit logs, which in...
apisnoop/snoopdb    	1.2.2        	v20230814-snoopdb-1.2.1-2-g2cccab9    	database for querying the test coverage of a ku...
apisnoop/snoopdb    	1.2.1        	v20230814-auditlogger-1.2.0-1-g87e0645	database for querying the test coverage of a ku...
apisnoop/snoopdb    	1.2.0        	2023.08.14-01                         	database for querying the test coverage of a ku...
apisnoop/snoopdb    	1.0.0        	v20230619-0.2.0-580-g1a98364          	database for querying the test coverage of a ku...
#+end_example
* install via helm cli
#+begin_src shell
helm
#+end_src
* Access via flux
